#+TITLE: Cookies, mmmmm.

"C is for Cookie, that's good enough for me!"
 --[[https://www.youtube.com/watch?v%3DYe8mB6VsUHw][Cookie Monster]]

"An HTTP cookie (web cookie, browser cookie) is a small piece of data
that a server sends to the user's web browser. The browser may store
it and send it back with the next request to the same server.
Typically, it's used to tell if two requests came from the same
browser — keeping a user logged-in, for example. It remembers stateful
information for the stateless HTTP protocol."
--https://developer.mozilla.org/en-US/docs/Web/HTTP/Cookies

* Testing Response Cookies

Below is a quick testing of the conversion to string of a few
varieties of cookies.

#+BEGIN_SRC scheme :results drawer :tangle no :post pretty-output(data=*this*)

    (import :std/format
            :drewc/ftw/timestamp
            :drewc/ftw/httpd/cookies)

    (with-output-to-string
      ""
      (lambda ()

        (printf "Simple cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  c)))

        (printf "Http-Only cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-http-only-set! c #t)
                                  c)))

        (printf "Domain cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-domain-set! c "http://mysite.com/")
                                  c)))

        (printf "Path cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-path-set! c "/index.htm")
                                  c)))

        (printf "Secure cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-secure-set! c #t)
                                  c)))

        (printf "Same Site Lax cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-samesite-set! c "Lax")
                                  c)))

        (printf "Same Site Strict cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-samesite-set! c "Strict")
                                  c)))

        (printf "Same Site None cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-samesite-set! c "None")
                                  c)))

        (printf "Expires cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-expires-set!
                                   c
                                   (date<-unix-timestamp
                                    (+ one-week (current-unix-timestamp))))
                                  c)))

        (printf "Max age cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-max-age-set!
                                   c
                                   (+ one-week (current-unix-timestamp)))
                                  c)))

        (printf "Kitchen sink cookie:  \"~a\"\n\n"
                (cookie->string (let ((c (cookie "CookieName" "CookieValue")))
                                  (cookie-max-age-set!
                                   c
                                   (+ one-week (current-unix-timestamp)))
                                  (cookie-expires-set!
                                   c
                                   (date<-unix-timestamp
                                    (+ one-week (current-unix-timestamp))))
                                  (cookie-samesite-set! c "Strict")
                                  (cookie-secure-set! c #t)
                                  (cookie-path-set! c "/index.htm")
                                  (cookie-domain-set! c "http://mysite.com/")
                                  (cookie-http-only-set! c #t)
                                  c)))

        ))

#+END_SRC

#+RESULTS:
:results:
Simple cookie:  "CookieName=CookieValue"

Http-Only cookie:  "CookieName=CookieValue; HttpOnly"

Domain cookie:  "CookieName=CookieValue; Domain=http://mysite.com/"

Path cookie:  "CookieName=CookieValue; Path=/index.htm"

Secure cookie:  "CookieName=CookieValue; Secure"

Same Site Lax cookie:  "CookieName=CookieValue; Same-Site=Lax"

Same Site Strict cookie:  "CookieName=CookieValue; Same-Site=Strict"

Same Site None cookie:  "CookieName=CookieValue; Same-Site=None"

Expires cookie:  "CookieName=CookieValue; Expires=Fri, 18 Sep 2020 00:31:02 GMT"

Max age cookie:  "CookieName=CookieValue; Max-Age=1600389062657015562"

Kitchen sink cookie:  "CookieName=CookieValue; Expires=Fri, 18 Sep 2020 00:31:02 GMT; Max-Age=1600389062657031059; Domain=http://mysite.com/; Path=/index.htm; Secure; HttpOnly; Same-Site=Strict"

:end:

